mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/common/s6e2d3xj.h
typedef struct stc_gdcsub_hsspic_clockdivider_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER  :16;
            __IO  uint32_t  RESERVED2            :8;
        };
        struct {
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER0 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER1 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER2 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER3 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER4 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER5 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER6 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER7 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER8 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER9 :1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER10:1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER11:1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER12:1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER13:1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER14:1;
            __IO  uint32_t  HSSPIC_CLOCKDIVIDER15:1;
            __IO  uint32_t  RESERVED3            :8;
        };
    };
} stc_gdcsub_hsspic_clockdivider_field_t;

typedef struct stc_gdcsub_hsspic_domaincontrol_field
{
        __IO  uint32_t  HSSPIC_CLOCKENABLE       :1;
        __IO  uint32_t  RESERVED0                :15;
        __IO  uint32_t  HSSPIC_SOFTWARERESET     :1;
        __IO  uint32_t  RESERVED1                :15;
} stc_gdcsub_hsspic_domaincontrol_field_t;

typedef struct stc_gdcsub_rpcc_clockdivider_field
{
    union {
        struct {
            __IO  uint32_t  RPCC_CLOCKDIVIDER    :3;
            __IO  uint32_t  RESERVED0            :29;
        };
        struct {
            __IO  uint32_t  RPCC_CLOCKDIVIDER0   :1;
            __IO  uint32_t  RPCC_CLOCKDIVIDER1   :1;
            __IO  uint32_t  RPCC_CLOCKDIVIDER2   :1;
            __IO  uint32_t  RESERVED1            :29;
        };
    };
} stc_gdcsub_rpcc_clockdivider_field_t;

typedef struct stc_gdcsub_rpcc_domaincontrol_field
{
        __IO  uint32_t  RPCC_CLOCKENABLE         :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gdcsub_rpcc_domaincontrol_field_t;

typedef struct stc_gdcsub_vram_lockunlock_field
{
    union {
        struct {
            __IO  uint32_t  VRAM_LOCKUNLOCK      :32;
        };
        struct {
            __IO  uint32_t  VRAM_LOCKUNLOCK0     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK1     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK2     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK3     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK4     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK5     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK6     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK7     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK8     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK9     :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK10    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK11    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK12    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK13    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK14    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK15    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK16    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK17    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK18    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK19    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK20    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK21    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK22    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK23    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK24    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK25    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK26    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK27    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK28    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK29    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK30    :1;
            __IO  uint32_t  VRAM_LOCKUNLOCK31    :1;
        };
    };
} stc_gdcsub_vram_lockunlock_field_t;

typedef struct stc_gdcsub_vram_lockstatus_field
{
        __IO  uint32_t  VRAM_LOCKSTATUS          :1;
        __IO  uint32_t  RESERVED0                :3;
        __IO  uint32_t  VRAM_PRIVILEGESTATUS     :1;
        __IO  uint32_t  RESERVED1                :3;
        __IO  uint32_t  VRAM_FREEZESTATUS        :1;
        __IO  uint32_t  RESERVED2                :23;
} stc_gdcsub_vram_lockstatus_field_t;

typedef struct stc_gdcsub_vram_sram_select_field
{
    union {
        struct {
            __IO  uint32_t  VRAM_SRAM_SELECT     :12;
            __IO  uint32_t  RESERVED0            :20;
        };
        struct {
            __IO  uint32_t  VRAM_SRAM_SELECT0    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT1    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT2    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT3    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT4    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT5    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT6    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT7    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT8    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT9    :1;
            __IO  uint32_t  VRAM_SRAM_SELECT10   :1;
            __IO  uint32_t  VRAM_SRAM_SELECT11   :1;
            __IO  uint32_t  RESERVED1            :20;
        };
    };
} stc_gdcsub_vram_sram_select_field_t;

typedef struct stc_gdcsub_vram_sberraddr_s0_field
{
    union {
        struct {
            __IO  uint32_t  VRAM_SBERRADDR_S0    :32;
        };
        struct {
            __IO  uint32_t  VRAM_SBERRADDR_S00   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S01   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S02   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S03   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S04   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S05   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S06   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S07   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S08   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S09   :1;
            __IO  uint32_t  VRAM_SBERRADDR_S010  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S011  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S012  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S013  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S014  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S015  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S016  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S017  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S018  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S019  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S020  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S021  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S022  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S023  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S024  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S025  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S026  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S027  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S028  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S029  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S030  :1;
            __IO  uint32_t  VRAM_SBERRADDR_S031  :1;
        };
    };
} stc_gdcsub_vram_sberraddr_s0_field_t;

