mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/common/s6e2d3xj.h
#define FM4_RTC_BREG3F_AVAILABLE                  1
#define FM_RTC_BREG3F_AVAILABLE                   1
#define FM4_RTC_BREG40_AVAILABLE                  1
#define FM_RTC_BREG40_AVAILABLE                   1
#define FM4_RTC_BREG41_AVAILABLE                  1
#define FM_RTC_BREG41_AVAILABLE                   1
#define FM4_RTC_BREG42_AVAILABLE                  1
#define FM_RTC_BREG42_AVAILABLE                   1
#define FM4_RTC_BREG43_AVAILABLE                  1
#define FM_RTC_BREG43_AVAILABLE                   1
#define FM4_RTC_BREG44_AVAILABLE                  1
#define FM_RTC_BREG44_AVAILABLE                   1
#define FM4_RTC_BREG45_AVAILABLE                  1
#define FM_RTC_BREG45_AVAILABLE                   1
#define FM4_RTC_BREG46_AVAILABLE                  1
#define FM_RTC_BREG46_AVAILABLE                   1
#define FM4_RTC_BREG47_AVAILABLE                  1
#define FM_RTC_BREG47_AVAILABLE                   1
#define FM4_RTC_BREG48_AVAILABLE                  1
#define FM_RTC_BREG48_AVAILABLE                   1
#define FM4_RTC_BREG49_AVAILABLE                  1
#define FM_RTC_BREG49_AVAILABLE                   1
#define FM4_RTC_BREG4A_AVAILABLE                  1
#define FM_RTC_BREG4A_AVAILABLE                   1
#define FM4_RTC_BREG4B_AVAILABLE                  1
#define FM_RTC_BREG4B_AVAILABLE                   1
#define FM4_RTC_BREG4C_AVAILABLE                  1
#define FM_RTC_BREG4C_AVAILABLE                   1
#define FM4_RTC_BREG4D_AVAILABLE                  1
#define FM_RTC_BREG4D_AVAILABLE                   1
#define FM4_RTC_BREG4E_AVAILABLE                  1
#define FM_RTC_BREG4E_AVAILABLE                   1
#define FM4_RTC_BREG4F_AVAILABLE                  1
#define FM_RTC_BREG4F_AVAILABLE                   1
#define FM4_RTC_BREG50_AVAILABLE                  1
#define FM_RTC_BREG50_AVAILABLE                   1
#define FM4_RTC_BREG51_AVAILABLE                  1
#define FM_RTC_BREG51_AVAILABLE                   1
#define FM4_RTC_BREG52_AVAILABLE                  1
#define FM_RTC_BREG52_AVAILABLE                   1
#define FM4_RTC_BREG53_AVAILABLE                  1
#define FM_RTC_BREG53_AVAILABLE                   1
#define FM4_RTC_BREG54_AVAILABLE                  1
#define FM_RTC_BREG54_AVAILABLE                   1
#define FM4_RTC_BREG55_AVAILABLE                  1
#define FM_RTC_BREG55_AVAILABLE                   1
#define FM4_RTC_BREG56_AVAILABLE                  1
#define FM_RTC_BREG56_AVAILABLE                   1
#define FM4_RTC_BREG57_AVAILABLE                  1
#define FM_RTC_BREG57_AVAILABLE                   1
#define FM4_RTC_BREG58_AVAILABLE                  1
#define FM_RTC_BREG58_AVAILABLE                   1
#define FM4_RTC_BREG59_AVAILABLE                  1
#define FM_RTC_BREG59_AVAILABLE                   1
#define FM4_RTC_BREG5A_AVAILABLE                  1
#define FM_RTC_BREG5A_AVAILABLE                   1
#define FM4_RTC_BREG5B_AVAILABLE                  1
#define FM_RTC_BREG5B_AVAILABLE                   1
#define FM4_RTC_BREG5C_AVAILABLE                  1
#define FM_RTC_BREG5C_AVAILABLE                   1
#define FM4_RTC_BREG5D_AVAILABLE                  1
#define FM_RTC_BREG5D_AVAILABLE                   1
#define FM4_RTC_BREG5E_AVAILABLE                  1
#define FM_RTC_BREG5E_AVAILABLE                   1
#define FM4_RTC_BREG5F_AVAILABLE                  1
#define FM_RTC_BREG5F_AVAILABLE                   1
#define FM4_RTC_BREG60_AVAILABLE                  1
#define FM_RTC_BREG60_AVAILABLE                   1
#define FM4_RTC_BREG61_AVAILABLE                  1
#define FM_RTC_BREG61_AVAILABLE                   1
#define FM4_RTC_BREG62_AVAILABLE                  1
#define FM_RTC_BREG62_AVAILABLE                   1
#define FM4_RTC_BREG63_AVAILABLE                  1
#define FM_RTC_BREG63_AVAILABLE                   1
#define FM4_RTC_BREG64_AVAILABLE                  1
#define FM_RTC_BREG64_AVAILABLE                   1
#define FM4_RTC_BREG65_AVAILABLE                  1
#define FM_RTC_BREG65_AVAILABLE                   1
#define FM4_RTC_BREG66_AVAILABLE                  1
#define FM_RTC_BREG66_AVAILABLE                   1
#define FM4_RTC_BREG67_AVAILABLE                  1
#define FM_RTC_BREG67_AVAILABLE                   1
#define FM4_RTC_BREG68_AVAILABLE                  1
#define FM_RTC_BREG68_AVAILABLE                   1
#define FM4_RTC_BREG69_AVAILABLE                  1
#define FM_RTC_BREG69_AVAILABLE                   1
#define FM4_RTC_BREG6A_AVAILABLE                  1
#define FM_RTC_BREG6A_AVAILABLE                   1
#define FM4_RTC_BREG6B_AVAILABLE                  1
#define FM_RTC_BREG6B_AVAILABLE                   1
#define FM4_RTC_BREG6C_AVAILABLE                  1
#define FM_RTC_BREG6C_AVAILABLE                   1
#define FM4_RTC_BREG6D_AVAILABLE                  1
#define FM_RTC_BREG6D_AVAILABLE                   1
#define FM4_RTC_BREG6E_AVAILABLE                  1
#define FM_RTC_BREG6E_AVAILABLE                   1
#define FM4_RTC_BREG6F_AVAILABLE                  1
#define FM_RTC_BREG6F_AVAILABLE                   1
#define FM4_RTC_BREG70_AVAILABLE                  1
#define FM_RTC_BREG70_AVAILABLE                   1
#define FM4_RTC_BREG71_AVAILABLE                  1
#define FM_RTC_BREG71_AVAILABLE                   1
#define FM4_RTC_BREG72_AVAILABLE                  1
#define FM_RTC_BREG72_AVAILABLE                   1
#define FM4_RTC_BREG73_AVAILABLE                  1
#define FM_RTC_BREG73_AVAILABLE                   1
#define FM4_RTC_BREG74_AVAILABLE                  1
#define FM_RTC_BREG74_AVAILABLE                   1
#define FM4_RTC_BREG75_AVAILABLE                  1
#define FM_RTC_BREG75_AVAILABLE                   1
#define FM4_RTC_BREG76_AVAILABLE                  1
#define FM_RTC_BREG76_AVAILABLE                   1
#define FM4_RTC_BREG77_AVAILABLE                  1
#define FM_RTC_BREG77_AVAILABLE                   1
#define FM4_RTC_BREG78_AVAILABLE                  1
#define FM_RTC_BREG78_AVAILABLE                   1
#define FM4_RTC_BREG79_AVAILABLE                  1
#define FM_RTC_BREG79_AVAILABLE                   1
#define FM4_RTC_BREG7A_AVAILABLE                  1
#define FM_RTC_BREG7A_AVAILABLE                   1
#define FM4_RTC_BREG7B_AVAILABLE                  1
#define FM_RTC_BREG7B_AVAILABLE                   1
#define FM4_RTC_BREG7C_AVAILABLE                  1
#define FM_RTC_BREG7C_AVAILABLE                   1
#define FM4_RTC_BREG7D_AVAILABLE                  1
#define FM_RTC_BREG7D_AVAILABLE                   1
#define FM4_RTC_BREG7E_AVAILABLE                  1
#define FM_RTC_BREG7E_AVAILABLE                   1
#define FM4_RTC_BREG7F_AVAILABLE                  1
#define FM_RTC_BREG7F_AVAILABLE                   1
#define FM4_RTC_CCB_AVAILABLE                     1
#define FM_RTC_CCB_AVAILABLE                      1
#define FM4_RTC_CCS_AVAILABLE                     1
#define FM_RTC_CCS_AVAILABLE                      1
#define FM4_RTC_EWKUP_AVAILABLE                   1
#define FM_RTC_EWKUP_AVAILABLE                    1
#define FM4_RTC_HIBRST_AVAILABLE                  1
#define FM_RTC_HIBRST_AVAILABLE                   1
#define FM4_RTC_VB_CLKDIV_AVAILABLE               1
#define FM_RTC_VB_CLKDIV_AVAILABLE                1
#define FM4_RTC_VBDDR_AVAILABLE                   1
#define FM_RTC_VBDDR_AVAILABLE                    1
#define FM4_RTC_VBDIR_AVAILABLE                   1
#define FM_RTC_VBDIR_AVAILABLE                    1
#define FM4_RTC_VBDOR_AVAILABLE                   1
#define FM_RTC_VBDOR_AVAILABLE                    1
#define FM4_RTC_VBPCR_AVAILABLE                   1
#define FM_RTC_VBPCR_AVAILABLE                    1
#define FM4_RTC_VBPFR_AVAILABLE                   1
#define FM_RTC_VBPFR_AVAILABLE                    1
#define FM4_RTC_VBPZR_AVAILABLE                   1
#define FM_RTC_VBPZR_AVAILABLE                    1
#define FM4_RTC_VDET_AVAILABLE                    1
#define FM_RTC_VDET_AVAILABLE                     1
#define FM4_RTC_WTCAL0_AVAILABLE                  1
#define FM_RTC_WTCAL0_AVAILABLE                   1
#define FM4_RTC_WTCAL1_AVAILABLE                  1
#define FM_RTC_WTCAL1_AVAILABLE                   1
#define FM4_RTC_WTCALEN_AVAILABLE                 1
#define FM_RTC_WTCALEN_AVAILABLE                  1
#define FM4_RTC_WTCALPRD_AVAILABLE                1
#define FM_RTC_WTCALPRD_AVAILABLE                 1
#define FM4_RTC_WTCOSEL_AVAILABLE                 1
#define FM_RTC_WTCOSEL_AVAILABLE                  1
#define FM4_RTC_WTCR10_AVAILABLE                  1
#define FM_RTC_WTCR10_AVAILABLE                   1
#define FM4_RTC_WTCR11_AVAILABLE                  1
#define FM_RTC_WTCR11_AVAILABLE                   1
#define FM4_RTC_WTCR12_AVAILABLE                  1
#define FM_RTC_WTCR12_AVAILABLE                   1
#define FM4_RTC_WTCR13_AVAILABLE                  1
#define FM_RTC_WTCR13_AVAILABLE                   1
#define FM4_RTC_WTCR20_AVAILABLE                  1
#define FM_RTC_WTCR20_AVAILABLE                   1
#define FM4_RTC_WTCR21_AVAILABLE                  1
#define FM_RTC_WTCR21_AVAILABLE                   1
#define FM4_RTC_WTDIV_AVAILABLE                   1
#define FM_RTC_WTDIV_AVAILABLE                    1
#define FM4_RTC_WTDIVEN_AVAILABLE                 1
#define FM_RTC_WTDIVEN_AVAILABLE                  1
#define FM4_RTC_WTDR_AVAILABLE                    1
#define FM_RTC_WTDR_AVAILABLE                     1
#define FM4_RTC_WTDW_AVAILABLE                    1
#define FM_RTC_WTDW_AVAILABLE                     1
#define FM4_RTC_WTHR_AVAILABLE                    1
#define FM_RTC_WTHR_AVAILABLE                     1
#define FM4_RTC_WTMIR_AVAILABLE                   1
#define FM_RTC_WTMIR_AVAILABLE                    1
#define FM4_RTC_WTMOR_AVAILABLE                   1
#define FM_RTC_WTMOR_AVAILABLE                    1
#define FM4_RTC_WTOSCCNT_AVAILABLE                1
#define FM_RTC_WTOSCCNT_AVAILABLE                 1
#define FM4_RTC_WTSR_AVAILABLE                    1
#define FM_RTC_WTSR_AVAILABLE                     1
#define FM4_RTC_WTTR0_AVAILABLE                   1
#define FM_RTC_WTTR0_AVAILABLE                    1
#define FM4_RTC_WTTR1_AVAILABLE                   1
#define FM_RTC_WTTR1_AVAILABLE                    1
#define FM4_RTC_WTTR2_AVAILABLE                   1
#define FM_RTC_WTTR2_AVAILABLE                    1
#define FM4_RTC_WTYR_AVAILABLE                    1
#define FM_RTC_WTYR_AVAILABLE                     1
/*******************************************************************************
* SBSSR
*******************************************************************************/
#define FM4_SBSSR_BTSSSR_AVAILABLE                1
#define FM_SBSSR_BTSSSR_AVAILABLE                 1
/*******************************************************************************
* SDRAMC
*******************************************************************************/
#define FM4_SDRAMC_PWRDWN_AVAILABLE               1
#define FM_SDRAMC_PWRDWN_AVAILABLE                1
#define FM4_SDRAMC_REFTIM_AVAILABLE               1
#define FM_SDRAMC_REFTIM_AVAILABLE                1
#define FM4_SDRAMC_SDCMD_AVAILABLE                1
#define FM_SDRAMC_SDCMD_AVAILABLE                 1
#define FM4_SDRAMC_SDMODE_AVAILABLE               1
#define FM_SDRAMC_SDMODE_AVAILABLE                1
#define FM4_SDRAMC_SDTIM_AVAILABLE                1
#define FM_SDRAMC_SDTIM_AVAILABLE                 1
/*******************************************************************************
* SWWDT
*******************************************************************************/
#define FM4_SWWDT_WDOGCONTROL_AVAILABLE           1
#define FM_SWWDT_WDOGCONTROL_AVAILABLE            1
#define FM4_SWWDT_WDOGINTCLR_AVAILABLE            1
#define FM_SWWDT_WDOGINTCLR_AVAILABLE             1
#define FM4_SWWDT_WDOGLOAD_AVAILABLE              1
#define FM_SWWDT_WDOGLOAD_AVAILABLE               1
#define FM4_SWWDT_WDOGLOCK_AVAILABLE              1
#define FM_SWWDT_WDOGLOCK_AVAILABLE               1
#define FM4_SWWDT_WDOGRIS_AVAILABLE               1
#define FM_SWWDT_WDOGRIS_AVAILABLE                1
#define FM4_SWWDT_WDOGSPMC_AVAILABLE              1
#define FM_SWWDT_WDOGSPMC_AVAILABLE               1
#define FM4_SWWDT_WDOGVALUE_AVAILABLE             1
#define FM_SWWDT_WDOGVALUE_AVAILABLE              1
/*******************************************************************************
* UNIQUE_ID
*******************************************************************************/
#define FM4_UNIQUE_ID_UIDR0_AVAILABLE             1
#define FM_UNIQUE_ID_UIDR0_AVAILABLE              1
#define FM4_UNIQUE_ID_UIDR1_AVAILABLE             1
#define FM_UNIQUE_ID_UIDR1_AVAILABLE              1
/*******************************************************************************
* USB0
*******************************************************************************/
#define FM4_USB_EP0C_AVAILABLE                    1
#define FM_USB_EP0C_AVAILABLE                     1
#define FM4_USB_EP0DT_AVAILABLE                   1
#define FM_USB_EP0DT_AVAILABLE                    1
#define FM4_USB_EP0IS_AVAILABLE                   1
#define FM_USB_EP0IS_AVAILABLE                    1
#define FM4_USB_EP0OS_AVAILABLE                   1
#define FM_USB_EP0OS_AVAILABLE                    1
#define FM4_USB_EP1C_AVAILABLE                    1
#define FM_USB_EP1C_AVAILABLE                     1
#define FM4_USB_EP1DT_AVAILABLE                   1
#define FM_USB_EP1DT_AVAILABLE                    1
#define FM4_USB_EP1S_AVAILABLE                    1
#define FM_USB_EP1S_AVAILABLE                     1
#define FM4_USB_EP2C_AVAILABLE                    1
#define FM_USB_EP2C_AVAILABLE                     1
#define FM4_USB_EP2DT_AVAILABLE                   1
#define FM_USB_EP2DT_AVAILABLE                    1
#define FM4_USB_EP2S_AVAILABLE                    1
#define FM_USB_EP2S_AVAILABLE                     1
#define FM4_USB_EP3C_AVAILABLE                    1
#define FM_USB_EP3C_AVAILABLE                     1
#define FM4_USB_EP3DT_AVAILABLE                   1
#define FM_USB_EP3DT_AVAILABLE                    1
#define FM4_USB_EP3S_AVAILABLE                    1
#define FM_USB_EP3S_AVAILABLE                     1
#define FM4_USB_EP4C_AVAILABLE                    1
#define FM_USB_EP4C_AVAILABLE                     1
#define FM4_USB_EP4DT_AVAILABLE                   1
#define FM_USB_EP4DT_AVAILABLE                    1
#define FM4_USB_EP4S_AVAILABLE                    1
#define FM_USB_EP4S_AVAILABLE                     1
#define FM4_USB_EP5C_AVAILABLE                    1
#define FM_USB_EP5C_AVAILABLE                     1
#define FM4_USB_EP5DT_AVAILABLE                   1
#define FM_USB_EP5DT_AVAILABLE                    1
#define FM4_USB_EP5S_AVAILABLE                    1
#define FM_USB_EP5S_AVAILABLE                     1
#define FM4_USB_HADR_AVAILABLE                    1
#define FM_USB_HADR_AVAILABLE                     1
#define FM4_USB_HCNT_AVAILABLE                    1
#define FM_USB_HCNT_AVAILABLE                     1
#define FM4_USB_HEOF_AVAILABLE                    1
#define FM_USB_HEOF_AVAILABLE                     1
#define FM4_USB_HERR_AVAILABLE                    1
#define FM_USB_HERR_AVAILABLE                     1
#define FM4_USB_HFCOMP_AVAILABLE                  1
#define FM_USB_HFCOMP_AVAILABLE                   1
#define FM4_USB_HFRAME_AVAILABLE                  1
#define FM_USB_HFRAME_AVAILABLE                   1
#define FM4_USB_HIRQ_AVAILABLE                    1
#define FM_USB_HIRQ_AVAILABLE                     1
#define FM4_USB_HRTIMER_AVAILABLE                 1
#define FM_USB_HRTIMER_AVAILABLE                  1
#define FM4_USB_HRTIMER2_AVAILABLE                1
#define FM_USB_HRTIMER2_AVAILABLE                 1
#define FM4_USB_HSTATE_AVAILABLE                  1
#define FM_USB_HSTATE_AVAILABLE                   1
#define FM4_USB_HTOKEN_AVAILABLE                  1
#define FM_USB_HTOKEN_AVAILABLE                   1
#define FM4_USB_TMSP_AVAILABLE                    1
#define FM_USB_TMSP_AVAILABLE                     1
#define FM4_USB_UDCC_AVAILABLE                    1
#define FM_USB_UDCC_AVAILABLE                     1
#define FM4_USB_UDCIE_AVAILABLE                   1
#define FM_USB_UDCIE_AVAILABLE                    1
#define FM4_USB_UDCS_AVAILABLE                    1
#define FM_USB_UDCS_AVAILABLE                     1
/*******************************************************************************
* USBCLK
*******************************************************************************/
#define FM4_USBCLK_UCCR_AVAILABLE                 1
#define FM_USBCLK_UCCR_AVAILABLE                  1
#define FM4_USBCLK_UP_STR_AVAILABLE               1
#define FM_USBCLK_UP_STR_AVAILABLE                1
#define FM4_USBCLK_UPCR1_AVAILABLE                1
#define FM_USBCLK_UPCR1_AVAILABLE                 1
#define FM4_USBCLK_UPCR2_AVAILABLE                1
#define FM_USBCLK_UPCR2_AVAILABLE                 1
#define FM4_USBCLK_UPCR3_AVAILABLE                1
#define FM_USBCLK_UPCR3_AVAILABLE                 1
#define FM4_USBCLK_UPCR4_AVAILABLE                1
#define FM_USBCLK_UPCR4_AVAILABLE                 1
#define FM4_USBCLK_UPCR5_AVAILABLE                1
#define FM_USBCLK_UPCR5_AVAILABLE                 1
#define FM4_USBCLK_UPINT_CLR_AVAILABLE            1
#define FM_USBCLK_UPINT_CLR_AVAILABLE             1
#define FM4_USBCLK_UPINT_ENR_AVAILABLE            1
#define FM_USBCLK_UPINT_ENR_AVAILABLE             1
#define FM4_USBCLK_UPINT_STR_AVAILABLE            1
#define FM_USBCLK_UPINT_STR_AVAILABLE             1
#define FM4_USBCLK_USBEN0_AVAILABLE               1
#define FM_USBCLK_USBEN0_AVAILABLE                1
#define FM4_USBCLK_USBEN1_AVAILABLE               1
#define FM_USBCLK_USBEN1_AVAILABLE                1
/*******************************************************************************
* WC
*******************************************************************************/
#define FM4_WC_CLK_EN_AVAILABLE                   1
#define FM_WC_CLK_EN_AVAILABLE                    1
#define FM4_WC_CLK_SEL_AVAILABLE                  1
#define FM_WC_CLK_SEL_AVAILABLE                   1
#define FM4_WC_WCCR_AVAILABLE                     1
#define FM_WC_WCCR_AVAILABLE                      1
#define FM4_WC_WCRD_AVAILABLE                     1
#define FM_WC_WCRD_AVAILABLE                      1
#define FM4_WC_WCRL_AVAILABLE                     1
#define FM_WC_WCRL_AVAILABLE                      1

