mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/common/s6e2d3xj.h
#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P0                         *((volatile  uint8_t *)(0x42DE4300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P1                         *((volatile  uint8_t *)(0x42DE4304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P2                         *((volatile  uint8_t *)(0x42DE4308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P3                         *((volatile  uint8_t *)(0x42DE430CUL))
#define bFM_GPIO_DDR6_P4                          *((volatile  uint8_t *)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P4                         *((volatile  uint8_t *)(0x42DE4310UL))
#define bFM_GPIO_DDR6_P5                          *((volatile  uint8_t *)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P5                         *((volatile  uint8_t *)(0x42DE4314UL))
#define bFM_GPIO_DDR6_P6                          *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P6                         *((volatile  uint8_t *)(0x42DE4318UL))
#define bFM_GPIO_DDR6_P7                          *((volatile  uint8_t *)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P7                         *((volatile  uint8_t *)(0x42DE431CUL))
#define bFM_GPIO_DDR6_P8                          *((volatile  uint8_t *)(0x42DE4320UL))
#define bFM4_GPIO_DDR6_P8                         *((volatile  uint8_t *)(0x42DE4320UL))

#define bFM_GPIO_DDR7_P0                          *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM4_GPIO_DDR7_P0                         *((volatile  uint8_t *)(0x42DE4380UL))
#define bFM_GPIO_DDR7_P1                          *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM4_GPIO_DDR7_P1                         *((volatile  uint8_t *)(0x42DE4384UL))
#define bFM_GPIO_DDR7_P2                          *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM4_GPIO_DDR7_P2                         *((volatile  uint8_t *)(0x42DE4388UL))
#define bFM_GPIO_DDR7_P3                          *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM4_GPIO_DDR7_P3                         *((volatile  uint8_t *)(0x42DE438CUL))
#define bFM_GPIO_DDR7_P4                          *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM4_GPIO_DDR7_P4                         *((volatile  uint8_t *)(0x42DE4390UL))
#define bFM_GPIO_DDR7_P5                          *((volatile  uint8_t *)(0x42DE4394UL))
#define bFM4_GPIO_DDR7_P5                         *((volatile  uint8_t *)(0x42DE4394UL))
#define bFM_GPIO_DDR7_P6                          *((volatile  uint8_t *)(0x42DE4398UL))
#define bFM4_GPIO_DDR7_P6                         *((volatile  uint8_t *)(0x42DE4398UL))
#define bFM_GPIO_DDR7_P7                          *((volatile  uint8_t *)(0x42DE439CUL))
#define bFM4_GPIO_DDR7_P7                         *((volatile  uint8_t *)(0x42DE439CUL))
#define bFM_GPIO_DDR7_P8                          *((volatile  uint8_t *)(0x42DE43A0UL))
#define bFM4_GPIO_DDR7_P8                         *((volatile  uint8_t *)(0x42DE43A0UL))
#define bFM_GPIO_DDR7_P9                          *((volatile  uint8_t *)(0x42DE43A4UL))
#define bFM4_GPIO_DDR7_P9                         *((volatile  uint8_t *)(0x42DE43A4UL))
#define bFM_GPIO_DDR7_PA                          *((volatile  uint8_t *)(0x42DE43A8UL))
#define bFM4_GPIO_DDR7_PA                         *((volatile  uint8_t *)(0x42DE43A8UL))
#define bFM_GPIO_DDR7_PB                          *((volatile  uint8_t *)(0x42DE43ACUL))
#define bFM4_GPIO_DDR7_PB                         *((volatile  uint8_t *)(0x42DE43ACUL))
#define bFM_GPIO_DDR7_PC                          *((volatile  uint8_t *)(0x42DE43B0UL))
#define bFM4_GPIO_DDR7_PC                         *((volatile  uint8_t *)(0x42DE43B0UL))

#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM4_GPIO_DDR8_P0                         *((volatile  uint8_t *)(0x42DE4400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42DE4404UL))
#define bFM4_GPIO_DDR8_P1                         *((volatile  uint8_t *)(0x42DE4404UL))

#define bFM_GPIO_DDR9_P0                          *((volatile  uint8_t *)(0x42DE4480UL))
#define bFM4_GPIO_DDR9_P0                         *((volatile  uint8_t *)(0x42DE4480UL))
#define bFM_GPIO_DDR9_P1                          *((volatile  uint8_t *)(0x42DE4484UL))
#define bFM4_GPIO_DDR9_P1                         *((volatile  uint8_t *)(0x42DE4484UL))
#define bFM_GPIO_DDR9_P2                          *((volatile  uint8_t *)(0x42DE4488UL))
#define bFM4_GPIO_DDR9_P2                         *((volatile  uint8_t *)(0x42DE4488UL))
#define bFM_GPIO_DDR9_P3                          *((volatile  uint8_t *)(0x42DE448CUL))
#define bFM4_GPIO_DDR9_P3                         *((volatile  uint8_t *)(0x42DE448CUL))
#define bFM_GPIO_DDR9_P4                          *((volatile  uint8_t *)(0x42DE4490UL))
#define bFM4_GPIO_DDR9_P4                         *((volatile  uint8_t *)(0x42DE4490UL))
#define bFM_GPIO_DDR9_P5                          *((volatile  uint8_t *)(0x42DE4494UL))
#define bFM4_GPIO_DDR9_P5                         *((volatile  uint8_t *)(0x42DE4494UL))
#define bFM_GPIO_DDR9_P6                          *((volatile  uint8_t *)(0x42DE4498UL))
#define bFM4_GPIO_DDR9_P6                         *((volatile  uint8_t *)(0x42DE4498UL))
#define bFM_GPIO_DDR9_P7                          *((volatile  uint8_t *)(0x42DE449CUL))
#define bFM4_GPIO_DDR9_P7                         *((volatile  uint8_t *)(0x42DE449CUL))

#define bFM_GPIO_DDRA_P0                          *((volatile  uint8_t *)(0x42DE4500UL))
#define bFM4_GPIO_DDRA_P0                         *((volatile  uint8_t *)(0x42DE4500UL))
#define bFM_GPIO_DDRA_P1                          *((volatile  uint8_t *)(0x42DE4504UL))
#define bFM4_GPIO_DDRA_P1                         *((volatile  uint8_t *)(0x42DE4504UL))
#define bFM_GPIO_DDRA_P2                          *((volatile  uint8_t *)(0x42DE4508UL))
#define bFM4_GPIO_DDRA_P2                         *((volatile  uint8_t *)(0x42DE4508UL))
#define bFM_GPIO_DDRA_P3                          *((volatile  uint8_t *)(0x42DE450CUL))
#define bFM4_GPIO_DDRA_P3                         *((volatile  uint8_t *)(0x42DE450CUL))
#define bFM_GPIO_DDRA_P4                          *((volatile  uint8_t *)(0x42DE4510UL))
#define bFM4_GPIO_DDRA_P4                         *((volatile  uint8_t *)(0x42DE4510UL))
#define bFM_GPIO_DDRA_P5                          *((volatile  uint8_t *)(0x42DE4514UL))
#define bFM4_GPIO_DDRA_P5                         *((volatile  uint8_t *)(0x42DE4514UL))
#define bFM_GPIO_DDRA_P6                          *((volatile  uint8_t *)(0x42DE4518UL))
#define bFM4_GPIO_DDRA_P6                         *((volatile  uint8_t *)(0x42DE4518UL))
#define bFM_GPIO_DDRA_P7                          *((volatile  uint8_t *)(0x42DE451CUL))
#define bFM4_GPIO_DDRA_P7                         *((volatile  uint8_t *)(0x42DE451CUL))
#define bFM_GPIO_DDRA_P8                          *((volatile  uint8_t *)(0x42DE4520UL))
#define bFM4_GPIO_DDRA_P8                         *((volatile  uint8_t *)(0x42DE4520UL))
#define bFM_GPIO_DDRA_P9                          *((volatile  uint8_t *)(0x42DE4524UL))
#define bFM4_GPIO_DDRA_P9                         *((volatile  uint8_t *)(0x42DE4524UL))
#define bFM_GPIO_DDRA_PA                          *((volatile  uint8_t *)(0x42DE4528UL))
#define bFM4_GPIO_DDRA_PA                         *((volatile  uint8_t *)(0x42DE4528UL))
#define bFM_GPIO_DDRA_PB                          *((volatile  uint8_t *)(0x42DE452CUL))
#define bFM4_GPIO_DDRA_PB                         *((volatile  uint8_t *)(0x42DE452CUL))
#define bFM_GPIO_DDRA_PC                          *((volatile  uint8_t *)(0x42DE4530UL))
#define bFM4_GPIO_DDRA_PC                         *((volatile  uint8_t *)(0x42DE4530UL))
#define bFM_GPIO_DDRA_PD                          *((volatile  uint8_t *)(0x42DE4534UL))
#define bFM4_GPIO_DDRA_PD                         *((volatile  uint8_t *)(0x42DE4534UL))

#define bFM_GPIO_DDRB_P0                          *((volatile  uint8_t *)(0x42DE4580UL))
#define bFM4_GPIO_DDRB_P0                         *((volatile  uint8_t *)(0x42DE4580UL))
#define bFM_GPIO_DDRB_P1                          *((volatile  uint8_t *)(0x42DE4584UL))
#define bFM4_GPIO_DDRB_P1                         *((volatile  uint8_t *)(0x42DE4584UL))
#define bFM_GPIO_DDRB_P2                          *((volatile  uint8_t *)(0x42DE4588UL))
#define bFM4_GPIO_DDRB_P2                         *((volatile  uint8_t *)(0x42DE4588UL))
#define bFM_GPIO_DDRB_P3                          *((volatile  uint8_t *)(0x42DE458CUL))
#define bFM4_GPIO_DDRB_P3                         *((volatile  uint8_t *)(0x42DE458CUL))
#define bFM_GPIO_DDRB_P4                          *((volatile  uint8_t *)(0x42DE4590UL))
#define bFM4_GPIO_DDRB_P4                         *((volatile  uint8_t *)(0x42DE4590UL))
#define bFM_GPIO_DDRB_P5                          *((volatile  uint8_t *)(0x42DE4594UL))
#define bFM4_GPIO_DDRB_P5                         *((volatile  uint8_t *)(0x42DE4594UL))
#define bFM_GPIO_DDRB_P6                          *((volatile  uint8_t *)(0x42DE4598UL))
#define bFM4_GPIO_DDRB_P6                         *((volatile  uint8_t *)(0x42DE4598UL))
#define bFM_GPIO_DDRB_P7                          *((volatile  uint8_t *)(0x42DE459CUL))
#define bFM4_GPIO_DDRB_P7                         *((volatile  uint8_t *)(0x42DE459CUL))
#define bFM_GPIO_DDRB_P8                          *((volatile  uint8_t *)(0x42DE45A0UL))
#define bFM4_GPIO_DDRB_P8                         *((volatile  uint8_t *)(0x42DE45A0UL))
#define bFM_GPIO_DDRB_P9                          *((volatile  uint8_t *)(0x42DE45A4UL))
#define bFM4_GPIO_DDRB_P9                         *((volatile  uint8_t *)(0x42DE45A4UL))
#define bFM_GPIO_DDRB_PA                          *((volatile  uint8_t *)(0x42DE45A8UL))
#define bFM4_GPIO_DDRB_PA                         *((volatile  uint8_t *)(0x42DE45A8UL))
#define bFM_GPIO_DDRB_PB                          *((volatile  uint8_t *)(0x42DE45ACUL))
#define bFM4_GPIO_DDRB_PB                         *((volatile  uint8_t *)(0x42DE45ACUL))
#define bFM_GPIO_DDRB_PC                          *((volatile  uint8_t *)(0x42DE45B0UL))
#define bFM4_GPIO_DDRB_PC                         *((volatile  uint8_t *)(0x42DE45B0UL))
#define bFM_GPIO_DDRB_PD                          *((volatile  uint8_t *)(0x42DE45B4UL))
#define bFM4_GPIO_DDRB_PD                         *((volatile  uint8_t *)(0x42DE45B4UL))

