mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/common/s6e2d3xj.h
#define bFM_GPIO_DDRC_P0                          *((volatile  uint8_t *)(0x42DE4600UL))
#define bFM4_GPIO_DDRC_P0                         *((volatile  uint8_t *)(0x42DE4600UL))
#define bFM_GPIO_DDRC_P1                          *((volatile  uint8_t *)(0x42DE4604UL))
#define bFM4_GPIO_DDRC_P1                         *((volatile  uint8_t *)(0x42DE4604UL))
#define bFM_GPIO_DDRC_P2                          *((volatile  uint8_t *)(0x42DE4608UL))
#define bFM4_GPIO_DDRC_P2                         *((volatile  uint8_t *)(0x42DE4608UL))
#define bFM_GPIO_DDRC_P3                          *((volatile  uint8_t *)(0x42DE460CUL))
#define bFM4_GPIO_DDRC_P3                         *((volatile  uint8_t *)(0x42DE460CUL))
#define bFM_GPIO_DDRC_P4                          *((volatile  uint8_t *)(0x42DE4610UL))
#define bFM4_GPIO_DDRC_P4                         *((volatile  uint8_t *)(0x42DE4610UL))
#define bFM_GPIO_DDRC_P5                          *((volatile  uint8_t *)(0x42DE4614UL))
#define bFM4_GPIO_DDRC_P5                         *((volatile  uint8_t *)(0x42DE4614UL))
#define bFM_GPIO_DDRC_P6                          *((volatile  uint8_t *)(0x42DE4618UL))
#define bFM4_GPIO_DDRC_P6                         *((volatile  uint8_t *)(0x42DE4618UL))
#define bFM_GPIO_DDRC_P7                          *((volatile  uint8_t *)(0x42DE461CUL))
#define bFM4_GPIO_DDRC_P7                         *((volatile  uint8_t *)(0x42DE461CUL))
#define bFM_GPIO_DDRC_P8                          *((volatile  uint8_t *)(0x42DE4620UL))
#define bFM4_GPIO_DDRC_P8                         *((volatile  uint8_t *)(0x42DE4620UL))
#define bFM_GPIO_DDRC_P9                          *((volatile  uint8_t *)(0x42DE4624UL))
#define bFM4_GPIO_DDRC_P9                         *((volatile  uint8_t *)(0x42DE4624UL))
#define bFM_GPIO_DDRC_PA                          *((volatile  uint8_t *)(0x42DE4628UL))
#define bFM4_GPIO_DDRC_PA                         *((volatile  uint8_t *)(0x42DE4628UL))
#define bFM_GPIO_DDRC_PB                          *((volatile  uint8_t *)(0x42DE462CUL))
#define bFM4_GPIO_DDRC_PB                         *((volatile  uint8_t *)(0x42DE462CUL))
#define bFM_GPIO_DDRC_PC                          *((volatile  uint8_t *)(0x42DE4630UL))
#define bFM4_GPIO_DDRC_PC                         *((volatile  uint8_t *)(0x42DE4630UL))
#define bFM_GPIO_DDRC_PD                          *((volatile  uint8_t *)(0x42DE4634UL))
#define bFM4_GPIO_DDRC_PD                         *((volatile  uint8_t *)(0x42DE4634UL))

#define bFM_GPIO_DDRD_P0                          *((volatile  uint8_t *)(0x42DE4680UL))
#define bFM4_GPIO_DDRD_P0                         *((volatile  uint8_t *)(0x42DE4680UL))
#define bFM_GPIO_DDRD_P1                          *((volatile  uint8_t *)(0x42DE4684UL))
#define bFM4_GPIO_DDRD_P1                         *((volatile  uint8_t *)(0x42DE4684UL))
#define bFM_GPIO_DDRD_P2                          *((volatile  uint8_t *)(0x42DE4688UL))
#define bFM4_GPIO_DDRD_P2                         *((volatile  uint8_t *)(0x42DE4688UL))
#define bFM_GPIO_DDRD_P3                          *((volatile  uint8_t *)(0x42DE468CUL))
#define bFM4_GPIO_DDRD_P3                         *((volatile  uint8_t *)(0x42DE468CUL))
#define bFM_GPIO_DDRD_P4                          *((volatile  uint8_t *)(0x42DE4690UL))
#define bFM4_GPIO_DDRD_P4                         *((volatile  uint8_t *)(0x42DE4690UL))
#define bFM_GPIO_DDRD_P5                          *((volatile  uint8_t *)(0x42DE4694UL))
#define bFM4_GPIO_DDRD_P5                         *((volatile  uint8_t *)(0x42DE4694UL))
#define bFM_GPIO_DDRD_P6                          *((volatile  uint8_t *)(0x42DE4698UL))
#define bFM4_GPIO_DDRD_P6                         *((volatile  uint8_t *)(0x42DE4698UL))
#define bFM_GPIO_DDRD_P7                          *((volatile  uint8_t *)(0x42DE469CUL))
#define bFM4_GPIO_DDRD_P7                         *((volatile  uint8_t *)(0x42DE469CUL))
#define bFM_GPIO_DDRD_P8                          *((volatile  uint8_t *)(0x42DE46A0UL))
#define bFM4_GPIO_DDRD_P8                         *((volatile  uint8_t *)(0x42DE46A0UL))
#define bFM_GPIO_DDRD_P9                          *((volatile  uint8_t *)(0x42DE46A4UL))
#define bFM4_GPIO_DDRD_P9                         *((volatile  uint8_t *)(0x42DE46A4UL))
#define bFM_GPIO_DDRD_PA                          *((volatile  uint8_t *)(0x42DE46A8UL))
#define bFM4_GPIO_DDRD_PA                         *((volatile  uint8_t *)(0x42DE46A8UL))
#define bFM_GPIO_DDRD_PB                          *((volatile  uint8_t *)(0x42DE46ACUL))
#define bFM4_GPIO_DDRD_PB                         *((volatile  uint8_t *)(0x42DE46ACUL))
#define bFM_GPIO_DDRD_PC                          *((volatile  uint8_t *)(0x42DE46B0UL))
#define bFM4_GPIO_DDRD_PC                         *((volatile  uint8_t *)(0x42DE46B0UL))
#define bFM_GPIO_DDRD_PD                          *((volatile  uint8_t *)(0x42DE46B4UL))
#define bFM4_GPIO_DDRD_PD                         *((volatile  uint8_t *)(0x42DE46B4UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM4_GPIO_DDRE_P0                         *((volatile  uint8_t *)(0x42DE4700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM4_GPIO_DDRE_P2                         *((volatile  uint8_t *)(0x42DE4708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x42DE470CUL))
#define bFM4_GPIO_DDRE_P3                         *((volatile  uint8_t *)(0x42DE470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x42DEC000UL))
#define bFM4_GPIO_EPFR00_NMIS                     *((volatile  uint8_t *)(0x42DEC000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x42DEC024UL))
#define bFM4_GPIO_EPFR00_USBP0E                   *((volatile  uint8_t *)(0x42DEC024UL))
#define bFM_GPIO_EPFR00_USBP1E                    *((volatile  uint8_t *)(0x42DEC034UL))
#define bFM4_GPIO_EPFR00_USBP1E                   *((volatile  uint8_t *)(0x42DEC034UL))
#define bFM_GPIO_EPFR00_JTAGEN0B                  *((volatile  uint8_t *)(0x42DEC040UL))
#define bFM4_GPIO_EPFR00_JTAGEN0B                 *((volatile  uint8_t *)(0x42DEC040UL))
#define bFM_GPIO_EPFR00_JTAGEN1S                  *((volatile  uint8_t *)(0x42DEC044UL))
#define bFM4_GPIO_EPFR00_JTAGEN1S                 *((volatile  uint8_t *)(0x42DEC044UL))
#define bFM_GPIO_EPFR00_TRC0E                     *((volatile  uint8_t *)(0x42DEC060UL))
#define bFM4_GPIO_EPFR00_TRC0E                    *((volatile  uint8_t *)(0x42DEC060UL))
#define bFM_GPIO_EPFR00_TRC1E                     *((volatile  uint8_t *)(0x42DEC064UL))
#define bFM4_GPIO_EPFR00_TRC1E                    *((volatile  uint8_t *)(0x42DEC064UL))

#define bFM_GPIO_EPFR01_DTTI0C                    *((volatile  uint8_t *)(0x42DEC0B0UL))
#define bFM4_GPIO_EPFR01_DTTI0C                   *((volatile  uint8_t *)(0x42DEC0B0UL))

#define bFM_GPIO_EPFR02_DTTI1C                    *((volatile  uint8_t *)(0x42DEC130UL))
#define bFM4_GPIO_EPFR02_DTTI1C                   *((volatile  uint8_t *)(0x42DEC130UL))

