mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/common/s6e2d3xj.h
/*******************************************************************************
* I2S Registers I2S1
*   Bitband Section
*******************************************************************************/
#define bFM_I2S1_CNTREG_FSPL                      *((volatile  uint8_t *)(0x42D90100UL))
#define bFM4_I2S1_CNTREG_FSPL                     *((volatile  uint8_t *)(0x42D90100UL))
#define bFM_I2S1_CNTREG_FSLN                      *((volatile  uint8_t *)(0x42D90104UL))
#define bFM4_I2S1_CNTREG_FSLN                     *((volatile  uint8_t *)(0x42D90104UL))
#define bFM_I2S1_CNTREG_FSPH                      *((volatile  uint8_t *)(0x42D90108UL))
#define bFM4_I2S1_CNTREG_FSPH                     *((volatile  uint8_t *)(0x42D90108UL))
#define bFM_I2S1_CNTREG_CPOL                      *((volatile  uint8_t *)(0x42D9010CUL))
#define bFM4_I2S1_CNTREG_CPOL                     *((volatile  uint8_t *)(0x42D9010CUL))
#define bFM_I2S1_CNTREG_SMPL                      *((volatile  uint8_t *)(0x42D90110UL))
#define bFM4_I2S1_CNTREG_SMPL                     *((volatile  uint8_t *)(0x42D90110UL))
#define bFM_I2S1_CNTREG_RXDIS                     *((volatile  uint8_t *)(0x42D90114UL))
#define bFM4_I2S1_CNTREG_RXDIS                    *((volatile  uint8_t *)(0x42D90114UL))
#define bFM_I2S1_CNTREG_TXDIS                     *((volatile  uint8_t *)(0x42D90118UL))
#define bFM4_I2S1_CNTREG_TXDIS                    *((volatile  uint8_t *)(0x42D90118UL))
#define bFM_I2S1_CNTREG_MLSB                      *((volatile  uint8_t *)(0x42D9011CUL))
#define bFM4_I2S1_CNTREG_MLSB                     *((volatile  uint8_t *)(0x42D9011CUL))
#define bFM_I2S1_CNTREG_FRUN                      *((volatile  uint8_t *)(0x42D90120UL))
#define bFM4_I2S1_CNTREG_FRUN                     *((volatile  uint8_t *)(0x42D90120UL))
#define bFM_I2S1_CNTREG_BEXT                      *((volatile  uint8_t *)(0x42D90124UL))
#define bFM4_I2S1_CNTREG_BEXT                     *((volatile  uint8_t *)(0x42D90124UL))
#define bFM_I2S1_CNTREG_ECKM                      *((volatile  uint8_t *)(0x42D90128UL))
#define bFM4_I2S1_CNTREG_ECKM                     *((volatile  uint8_t *)(0x42D90128UL))
#define bFM_I2S1_CNTREG_RHLL                      *((volatile  uint8_t *)(0x42D9012CUL))
#define bFM4_I2S1_CNTREG_RHLL                     *((volatile  uint8_t *)(0x42D9012CUL))
#define bFM_I2S1_CNTREG_SBFN                      *((volatile  uint8_t *)(0x42D90130UL))
#define bFM4_I2S1_CNTREG_SBFN                     *((volatile  uint8_t *)(0x42D90130UL))
#define bFM_I2S1_CNTREG_MSMD                      *((volatile  uint8_t *)(0x42D90134UL))
#define bFM4_I2S1_CNTREG_MSMD                     *((volatile  uint8_t *)(0x42D90134UL))
#define bFM_I2S1_CNTREG_MSKB                      *((volatile  uint8_t *)(0x42D90138UL))
#define bFM4_I2S1_CNTREG_MSKB                     *((volatile  uint8_t *)(0x42D90138UL))

#define bFM_I2S1_DMAACT_RDMACT                    *((volatile  uint8_t *)(0x42D90500UL))
#define bFM4_I2S1_DMAACT_RDMACT                   *((volatile  uint8_t *)(0x42D90500UL))
#define bFM_I2S1_DMAACT_RL1E0                     *((volatile  uint8_t *)(0x42D90520UL))
#define bFM4_I2S1_DMAACT_RL1E0                    *((volatile  uint8_t *)(0x42D90520UL))
#define bFM_I2S1_DMAACT_TDMACT                    *((volatile  uint8_t *)(0x42D90540UL))
#define bFM4_I2S1_DMAACT_TDMACT                   *((volatile  uint8_t *)(0x42D90540UL))
#define bFM_I2S1_DMAACT_TL1E0                     *((volatile  uint8_t *)(0x42D90560UL))
#define bFM4_I2S1_DMAACT_TL1E0                    *((volatile  uint8_t *)(0x42D90560UL))

#define bFM_I2S1_INTCNT_RXFIM                     *((volatile  uint8_t *)(0x42D90440UL))
#define bFM4_I2S1_INTCNT_RXFIM                    *((volatile  uint8_t *)(0x42D90440UL))
#define bFM_I2S1_INTCNT_RXFDM                     *((volatile  uint8_t *)(0x42D90444UL))
#define bFM4_I2S1_INTCNT_RXFDM                    *((volatile  uint8_t *)(0x42D90444UL))
#define bFM_I2S1_INTCNT_EOPM                      *((volatile  uint8_t *)(0x42D90448UL))
#define bFM4_I2S1_INTCNT_EOPM                     *((volatile  uint8_t *)(0x42D90448UL))
#define bFM_I2S1_INTCNT_RXOVM                     *((volatile  uint8_t *)(0x42D9044CUL))
#define bFM4_I2S1_INTCNT_RXOVM                    *((volatile  uint8_t *)(0x42D9044CUL))
#define bFM_I2S1_INTCNT_RXUDM                     *((volatile  uint8_t *)(0x42D90450UL))
#define bFM4_I2S1_INTCNT_RXUDM                    *((volatile  uint8_t *)(0x42D90450UL))
#define bFM_I2S1_INTCNT_RBERM                     *((volatile  uint8_t *)(0x42D90454UL))
#define bFM4_I2S1_INTCNT_RBERM                    *((volatile  uint8_t *)(0x42D90454UL))
#define bFM_I2S1_INTCNT_TXFIM                     *((volatile  uint8_t *)(0x42D90460UL))
#define bFM4_I2S1_INTCNT_TXFIM                    *((volatile  uint8_t *)(0x42D90460UL))
#define bFM_I2S1_INTCNT_TXFDM                     *((volatile  uint8_t *)(0x42D90464UL))
#define bFM4_I2S1_INTCNT_TXFDM                    *((volatile  uint8_t *)(0x42D90464UL))
#define bFM_I2S1_INTCNT_TXOVM                     *((volatile  uint8_t *)(0x42D90468UL))
#define bFM4_I2S1_INTCNT_TXOVM                    *((volatile  uint8_t *)(0x42D90468UL))
#define bFM_I2S1_INTCNT_TXUD0M                    *((volatile  uint8_t *)(0x42D9046CUL))
#define bFM4_I2S1_INTCNT_TXUD0M                   *((volatile  uint8_t *)(0x42D9046CUL))
#define bFM_I2S1_INTCNT_FERRM                     *((volatile  uint8_t *)(0x42D90470UL))
#define bFM4_I2S1_INTCNT_FERRM                    *((volatile  uint8_t *)(0x42D90470UL))
#define bFM_I2S1_INTCNT_TBERM                     *((volatile  uint8_t *)(0x42D90474UL))
#define bFM4_I2S1_INTCNT_TBERM                    *((volatile  uint8_t *)(0x42D90474UL))
#define bFM_I2S1_INTCNT_TXUD1M                    *((volatile  uint8_t *)(0x42D90478UL))
#define bFM4_I2S1_INTCNT_TXUD1M                   *((volatile  uint8_t *)(0x42D90478UL))

#define bFM_I2S1_MCR1REG_S0CH00                   *((volatile  uint8_t *)(0x42D90200UL))
#define bFM4_I2S1_MCR1REG_S0CH00                  *((volatile  uint8_t *)(0x42D90200UL))
#define bFM_I2S1_MCR1REG_S0CH01                   *((volatile  uint8_t *)(0x42D90204UL))
#define bFM4_I2S1_MCR1REG_S0CH01                  *((volatile  uint8_t *)(0x42D90204UL))
#define bFM_I2S1_MCR1REG_S0CH02                   *((volatile  uint8_t *)(0x42D90208UL))
#define bFM4_I2S1_MCR1REG_S0CH02                  *((volatile  uint8_t *)(0x42D90208UL))
#define bFM_I2S1_MCR1REG_S0CH03                   *((volatile  uint8_t *)(0x42D9020CUL))
#define bFM4_I2S1_MCR1REG_S0CH03                  *((volatile  uint8_t *)(0x42D9020CUL))
#define bFM_I2S1_MCR1REG_S0CH04                   *((volatile  uint8_t *)(0x42D90210UL))
#define bFM4_I2S1_MCR1REG_S0CH04                  *((volatile  uint8_t *)(0x42D90210UL))
#define bFM_I2S1_MCR1REG_S0CH05                   *((volatile  uint8_t *)(0x42D90214UL))
#define bFM4_I2S1_MCR1REG_S0CH05                  *((volatile  uint8_t *)(0x42D90214UL))
#define bFM_I2S1_MCR1REG_S0CH06                   *((volatile  uint8_t *)(0x42D90218UL))
#define bFM4_I2S1_MCR1REG_S0CH06                  *((volatile  uint8_t *)(0x42D90218UL))
#define bFM_I2S1_MCR1REG_S0CH07                   *((volatile  uint8_t *)(0x42D9021CUL))
#define bFM4_I2S1_MCR1REG_S0CH07                  *((volatile  uint8_t *)(0x42D9021CUL))
#define bFM_I2S1_MCR1REG_S0CH08                   *((volatile  uint8_t *)(0x42D90220UL))
#define bFM4_I2S1_MCR1REG_S0CH08                  *((volatile  uint8_t *)(0x42D90220UL))
#define bFM_I2S1_MCR1REG_S0CH09                   *((volatile  uint8_t *)(0x42D90224UL))
#define bFM4_I2S1_MCR1REG_S0CH09                  *((volatile  uint8_t *)(0x42D90224UL))
#define bFM_I2S1_MCR1REG_S0CH10                   *((volatile  uint8_t *)(0x42D90228UL))
#define bFM4_I2S1_MCR1REG_S0CH10                  *((volatile  uint8_t *)(0x42D90228UL))
#define bFM_I2S1_MCR1REG_S0CH11                   *((volatile  uint8_t *)(0x42D9022CUL))
#define bFM4_I2S1_MCR1REG_S0CH11                  *((volatile  uint8_t *)(0x42D9022CUL))
#define bFM_I2S1_MCR1REG_S0CH12                   *((volatile  uint8_t *)(0x42D90230UL))
#define bFM4_I2S1_MCR1REG_S0CH12                  *((volatile  uint8_t *)(0x42D90230UL))
#define bFM_I2S1_MCR1REG_S0CH13                   *((volatile  uint8_t *)(0x42D90234UL))
#define bFM4_I2S1_MCR1REG_S0CH13                  *((volatile  uint8_t *)(0x42D90234UL))
#define bFM_I2S1_MCR1REG_S0CH14                   *((volatile  uint8_t *)(0x42D90238UL))
#define bFM4_I2S1_MCR1REG_S0CH14                  *((volatile  uint8_t *)(0x42D90238UL))
#define bFM_I2S1_MCR1REG_S0CH15                   *((volatile  uint8_t *)(0x42D9023CUL))
#define bFM4_I2S1_MCR1REG_S0CH15                  *((volatile  uint8_t *)(0x42D9023CUL))
#define bFM_I2S1_MCR1REG_S0CH16                   *((volatile  uint8_t *)(0x42D90240UL))
#define bFM4_I2S1_MCR1REG_S0CH16                  *((volatile  uint8_t *)(0x42D90240UL))
#define bFM_I2S1_MCR1REG_S0CH17                   *((volatile  uint8_t *)(0x42D90244UL))
#define bFM4_I2S1_MCR1REG_S0CH17                  *((volatile  uint8_t *)(0x42D90244UL))
#define bFM_I2S1_MCR1REG_S0CH18                   *((volatile  uint8_t *)(0x42D90248UL))
#define bFM4_I2S1_MCR1REG_S0CH18                  *((volatile  uint8_t *)(0x42D90248UL))
#define bFM_I2S1_MCR1REG_S0CH19                   *((volatile  uint8_t *)(0x42D9024CUL))
#define bFM4_I2S1_MCR1REG_S0CH19                  *((volatile  uint8_t *)(0x42D9024CUL))
#define bFM_I2S1_MCR1REG_S0CH20                   *((volatile  uint8_t *)(0x42D90250UL))
#define bFM4_I2S1_MCR1REG_S0CH20                  *((volatile  uint8_t *)(0x42D90250UL))
#define bFM_I2S1_MCR1REG_S0CH21                   *((volatile  uint8_t *)(0x42D90254UL))
#define bFM4_I2S1_MCR1REG_S0CH21                  *((volatile  uint8_t *)(0x42D90254UL))
#define bFM_I2S1_MCR1REG_S0CH22                   *((volatile  uint8_t *)(0x42D90258UL))
#define bFM4_I2S1_MCR1REG_S0CH22                  *((volatile  uint8_t *)(0x42D90258UL))
#define bFM_I2S1_MCR1REG_S0CH23                   *((volatile  uint8_t *)(0x42D9025CUL))
#define bFM4_I2S1_MCR1REG_S0CH23                  *((volatile  uint8_t *)(0x42D9025CUL))
#define bFM_I2S1_MCR1REG_S0CH24                   *((volatile  uint8_t *)(0x42D90260UL))
#define bFM4_I2S1_MCR1REG_S0CH24                  *((volatile  uint8_t *)(0x42D90260UL))
#define bFM_I2S1_MCR1REG_S0CH25                   *((volatile  uint8_t *)(0x42D90264UL))
#define bFM4_I2S1_MCR1REG_S0CH25                  *((volatile  uint8_t *)(0x42D90264UL))
#define bFM_I2S1_MCR1REG_S0CH26                   *((volatile  uint8_t *)(0x42D90268UL))
#define bFM4_I2S1_MCR1REG_S0CH26                  *((volatile  uint8_t *)(0x42D90268UL))
#define bFM_I2S1_MCR1REG_S0CH27                   *((volatile  uint8_t *)(0x42D9026CUL))
#define bFM4_I2S1_MCR1REG_S0CH27                  *((volatile  uint8_t *)(0x42D9026CUL))
#define bFM_I2S1_MCR1REG_S0CH28                   *((volatile  uint8_t *)(0x42D90270UL))
#define bFM4_I2S1_MCR1REG_S0CH28                  *((volatile  uint8_t *)(0x42D90270UL))
#define bFM_I2S1_MCR1REG_S0CH29                   *((volatile  uint8_t *)(0x42D90274UL))
#define bFM4_I2S1_MCR1REG_S0CH29                  *((volatile  uint8_t *)(0x42D90274UL))
#define bFM_I2S1_MCR1REG_S0CH30                   *((volatile  uint8_t *)(0x42D90278UL))
#define bFM4_I2S1_MCR1REG_S0CH30                  *((volatile  uint8_t *)(0x42D90278UL))
#define bFM_I2S1_MCR1REG_S0CH31                   *((volatile  uint8_t *)(0x42D9027CUL))
#define bFM4_I2S1_MCR1REG_S0CH31                  *((volatile  uint8_t *)(0x42D9027CUL))

#define bFM_I2S1_MCR2REG_S1CH00                   *((volatile  uint8_t *)(0x42D90280UL))
#define bFM4_I2S1_MCR2REG_S1CH00                  *((volatile  uint8_t *)(0x42D90280UL))
#define bFM_I2S1_MCR2REG_S1CH01                   *((volatile  uint8_t *)(0x42D90284UL))
#define bFM4_I2S1_MCR2REG_S1CH01                  *((volatile  uint8_t *)(0x42D90284UL))
#define bFM_I2S1_MCR2REG_S1CH02                   *((volatile  uint8_t *)(0x42D90288UL))
#define bFM4_I2S1_MCR2REG_S1CH02                  *((volatile  uint8_t *)(0x42D90288UL))
#define bFM_I2S1_MCR2REG_S1CH03                   *((volatile  uint8_t *)(0x42D9028CUL))
#define bFM4_I2S1_MCR2REG_S1CH03                  *((volatile  uint8_t *)(0x42D9028CUL))
#define bFM_I2S1_MCR2REG_S1CH04                   *((volatile  uint8_t *)(0x42D90290UL))
#define bFM4_I2S1_MCR2REG_S1CH04                  *((volatile  uint8_t *)(0x42D90290UL))
#define bFM_I2S1_MCR2REG_S1CH05                   *((volatile  uint8_t *)(0x42D90294UL))
#define bFM4_I2S1_MCR2REG_S1CH05                  *((volatile  uint8_t *)(0x42D90294UL))
#define bFM_I2S1_MCR2REG_S1CH06                   *((volatile  uint8_t *)(0x42D90298UL))
#define bFM4_I2S1_MCR2REG_S1CH06                  *((volatile  uint8_t *)(0x42D90298UL))
#define bFM_I2S1_MCR2REG_S1CH07                   *((volatile  uint8_t *)(0x42D9029CUL))
#define bFM4_I2S1_MCR2REG_S1CH07                  *((volatile  uint8_t *)(0x42D9029CUL))
#define bFM_I2S1_MCR2REG_S1CH08                   *((volatile  uint8_t *)(0x42D902A0UL))
#define bFM4_I2S1_MCR2REG_S1CH08                  *((volatile  uint8_t *)(0x42D902A0UL))
#define bFM_I2S1_MCR2REG_S1CH09                   *((volatile  uint8_t *)(0x42D902A4UL))
#define bFM4_I2S1_MCR2REG_S1CH09                  *((volatile  uint8_t *)(0x42D902A4UL))
#define bFM_I2S1_MCR2REG_S1CH10                   *((volatile  uint8_t *)(0x42D902A8UL))
#define bFM4_I2S1_MCR2REG_S1CH10                  *((volatile  uint8_t *)(0x42D902A8UL))
#define bFM_I2S1_MCR2REG_S1CH11                   *((volatile  uint8_t *)(0x42D902ACUL))
#define bFM4_I2S1_MCR2REG_S1CH11                  *((volatile  uint8_t *)(0x42D902ACUL))
#define bFM_I2S1_MCR2REG_S1CH12                   *((volatile  uint8_t *)(0x42D902B0UL))
#define bFM4_I2S1_MCR2REG_S1CH12                  *((volatile  uint8_t *)(0x42D902B0UL))
#define bFM_I2S1_MCR2REG_S1CH13                   *((volatile  uint8_t *)(0x42D902B4UL))
#define bFM4_I2S1_MCR2REG_S1CH13                  *((volatile  uint8_t *)(0x42D902B4UL))
#define bFM_I2S1_MCR2REG_S1CH14                   *((volatile  uint8_t *)(0x42D902B8UL))
#define bFM4_I2S1_MCR2REG_S1CH14                  *((volatile  uint8_t *)(0x42D902B8UL))
#define bFM_I2S1_MCR2REG_S1CH15                   *((volatile  uint8_t *)(0x42D902BCUL))
#define bFM4_I2S1_MCR2REG_S1CH15                  *((volatile  uint8_t *)(0x42D902BCUL))
#define bFM_I2S1_MCR2REG_S1CH16                   *((volatile  uint8_t *)(0x42D902C0UL))
#define bFM4_I2S1_MCR2REG_S1CH16                  *((volatile  uint8_t *)(0x42D902C0UL))
#define bFM_I2S1_MCR2REG_S1CH17                   *((volatile  uint8_t *)(0x42D902C4UL))
#define bFM4_I2S1_MCR2REG_S1CH17                  *((volatile  uint8_t *)(0x42D902C4UL))
#define bFM_I2S1_MCR2REG_S1CH18                   *((volatile  uint8_t *)(0x42D902C8UL))
#define bFM4_I2S1_MCR2REG_S1CH18                  *((volatile  uint8_t *)(0x42D902C8UL))
#define bFM_I2S1_MCR2REG_S1CH19                   *((volatile  uint8_t *)(0x42D902CCUL))
#define bFM4_I2S1_MCR2REG_S1CH19                  *((volatile  uint8_t *)(0x42D902CCUL))
#define bFM_I2S1_MCR2REG_S1CH20                   *((volatile  uint8_t *)(0x42D902D0UL))
#define bFM4_I2S1_MCR2REG_S1CH20                  *((volatile  uint8_t *)(0x42D902D0UL))
#define bFM_I2S1_MCR2REG_S1CH21                   *((volatile  uint8_t *)(0x42D902D4UL))
#define bFM4_I2S1_MCR2REG_S1CH21                  *((volatile  uint8_t *)(0x42D902D4UL))
#define bFM_I2S1_MCR2REG_S1CH22                   *((volatile  uint8_t *)(0x42D902D8UL))
#define bFM4_I2S1_MCR2REG_S1CH22                  *((volatile  uint8_t *)(0x42D902D8UL))
#define bFM_I2S1_MCR2REG_S1CH23                   *((volatile  uint8_t *)(0x42D902DCUL))
#define bFM4_I2S1_MCR2REG_S1CH23                  *((volatile  uint8_t *)(0x42D902DCUL))
#define bFM_I2S1_MCR2REG_S1CH24                   *((volatile  uint8_t *)(0x42D902E0UL))
#define bFM4_I2S1_MCR2REG_S1CH24                  *((volatile  uint8_t *)(0x42D902E0UL))
#define bFM_I2S1_MCR2REG_S1CH25                   *((volatile  uint8_t *)(0x42D902E4UL))
#define bFM4_I2S1_MCR2REG_S1CH25                  *((volatile  uint8_t *)(0x42D902E4UL))
#define bFM_I2S1_MCR2REG_S1CH26                   *((volatile  uint8_t *)(0x42D902E8UL))
#define bFM4_I2S1_MCR2REG_S1CH26                  *((volatile  uint8_t *)(0x42D902E8UL))
#define bFM_I2S1_MCR2REG_S1CH27                   *((volatile  uint8_t *)(0x42D902ECUL))
#define bFM4_I2S1_MCR2REG_S1CH27                  *((volatile  uint8_t *)(0x42D902ECUL))
#define bFM_I2S1_MCR2REG_S1CH28                   *((volatile  uint8_t *)(0x42D902F0UL))
#define bFM4_I2S1_MCR2REG_S1CH28                  *((volatile  uint8_t *)(0x42D902F0UL))
#define bFM_I2S1_MCR2REG_S1CH29                   *((volatile  uint8_t *)(0x42D902F4UL))
#define bFM4_I2S1_MCR2REG_S1CH29                  *((volatile  uint8_t *)(0x42D902F4UL))
#define bFM_I2S1_MCR2REG_S1CH30                   *((volatile  uint8_t *)(0x42D902F8UL))
#define bFM4_I2S1_MCR2REG_S1CH30                  *((volatile  uint8_t *)(0x42D902F8UL))
#define bFM_I2S1_MCR2REG_S1CH31                   *((volatile  uint8_t *)(0x42D902FCUL))
#define bFM4_I2S1_MCR2REG_S1CH31                  *((volatile  uint8_t *)(0x42D902FCUL))

