mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d3xj/common/s6e2d3xj.h
#define bFM_INTREQ_IRQ106MON_MFSINT9_TX           *((volatile  uint8_t *)(0x42627580UL))
#define bFM4_INTREQ_IRQ106MON_MFSINT9_TX          *((volatile  uint8_t *)(0x42627580UL))
#define bFM_INTREQ_IRQ106MON_MFSINT9_STATUS       *((volatile  uint8_t *)(0x42627584UL))
#define bFM4_INTREQ_IRQ106MON_MFSINT9_STATUS      *((volatile  uint8_t *)(0x42627584UL))
#define bFM_INTREQ_IRQ106MON_GDCINT               *((volatile  uint8_t *)(0x426275A0UL))
#define bFM4_INTREQ_IRQ106MON_GDCINT              *((volatile  uint8_t *)(0x426275A0UL))

#define bFM_INTREQ_IRQ107MON_MFSINT10_RX          *((volatile  uint8_t *)(0x42627600UL))
#define bFM4_INTREQ_IRQ107MON_MFSINT10_RX         *((volatile  uint8_t *)(0x42627600UL))
#define bFM_INTREQ_IRQ107MON_GDCINT               *((volatile  uint8_t *)(0x42627620UL))
#define bFM4_INTREQ_IRQ107MON_GDCINT              *((volatile  uint8_t *)(0x42627620UL))

#define bFM_INTREQ_IRQ108MON_MFSINT10_TX          *((volatile  uint8_t *)(0x42627680UL))
#define bFM4_INTREQ_IRQ108MON_MFSINT10_TX         *((volatile  uint8_t *)(0x42627680UL))
#define bFM_INTREQ_IRQ108MON_MFSINT10_STATUS      *((volatile  uint8_t *)(0x42627684UL))
#define bFM4_INTREQ_IRQ108MON_MFSINT10_STATUS     *((volatile  uint8_t *)(0x42627684UL))
#define bFM_INTREQ_IRQ108MON_GDCINT               *((volatile  uint8_t *)(0x426276A0UL))
#define bFM4_INTREQ_IRQ108MON_GDCINT              *((volatile  uint8_t *)(0x426276A0UL))

#define bFM_INTREQ_IRQ109MON_MFSINT11_RX          *((volatile  uint8_t *)(0x42627700UL))
#define bFM4_INTREQ_IRQ109MON_MFSINT11_RX         *((volatile  uint8_t *)(0x42627700UL))
#define bFM_INTREQ_IRQ109MON_GDCINT               *((volatile  uint8_t *)(0x42627720UL))
#define bFM4_INTREQ_IRQ109MON_GDCINT              *((volatile  uint8_t *)(0x42627720UL))

#define bFM_INTREQ_IRQ110MON_MFSINT11_TX          *((volatile  uint8_t *)(0x42627780UL))
#define bFM4_INTREQ_IRQ110MON_MFSINT11_TX         *((volatile  uint8_t *)(0x42627780UL))
#define bFM_INTREQ_IRQ110MON_MFSINT11_STATUS      *((volatile  uint8_t *)(0x42627784UL))
#define bFM4_INTREQ_IRQ110MON_MFSINT11_STATUS     *((volatile  uint8_t *)(0x42627784UL))
#define bFM_INTREQ_IRQ110MON_GDCINT               *((volatile  uint8_t *)(0x426277A0UL))
#define bFM4_INTREQ_IRQ110MON_GDCINT              *((volatile  uint8_t *)(0x426277A0UL))

#define bFM_INTREQ_IRQ111MON_ADCINT0              *((volatile  uint8_t *)(0x42627800UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT0             *((volatile  uint8_t *)(0x42627800UL))
#define bFM_INTREQ_IRQ111MON_ADCINT1              *((volatile  uint8_t *)(0x42627804UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT1             *((volatile  uint8_t *)(0x42627804UL))
#define bFM_INTREQ_IRQ111MON_ADCINT2              *((volatile  uint8_t *)(0x42627808UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT2             *((volatile  uint8_t *)(0x42627808UL))
#define bFM_INTREQ_IRQ111MON_ADCINT3              *((volatile  uint8_t *)(0x4262780CUL))
#define bFM4_INTREQ_IRQ111MON_ADCINT3             *((volatile  uint8_t *)(0x4262780CUL))
#define bFM_INTREQ_IRQ111MON_ADCINT4              *((volatile  uint8_t *)(0x42627810UL))
#define bFM4_INTREQ_IRQ111MON_ADCINT4             *((volatile  uint8_t *)(0x42627810UL))

#define bFM_INTREQ_IRQ112MON_I2S0DINT0            *((volatile  uint8_t *)(0x42627880UL))
#define bFM4_INTREQ_IRQ112MON_I2S0DINT0           *((volatile  uint8_t *)(0x42627880UL))
#define bFM_INTREQ_IRQ112MON_I2S0DINT1            *((volatile  uint8_t *)(0x42627884UL))
#define bFM4_INTREQ_IRQ112MON_I2S0DINT1           *((volatile  uint8_t *)(0x42627884UL))
#define bFM_INTREQ_IRQ112MON_HSSPIDINT0           *((volatile  uint8_t *)(0x42627888UL))
#define bFM4_INTREQ_IRQ112MON_HSSPIDINT0          *((volatile  uint8_t *)(0x42627888UL))
#define bFM_INTREQ_IRQ112MON_HSSPIDINT1           *((volatile  uint8_t *)(0x4262788CUL))
#define bFM4_INTREQ_IRQ112MON_HSSPIDINT1          *((volatile  uint8_t *)(0x4262788CUL))
#define bFM_INTREQ_IRQ112MON_PCRCDINT             *((volatile  uint8_t *)(0x42627890UL))
#define bFM4_INTREQ_IRQ112MON_PCRCDINT            *((volatile  uint8_t *)(0x42627890UL))
#define bFM_INTREQ_IRQ112MON_CANDINT              *((volatile  uint8_t *)(0x42627894UL))
#define bFM4_INTREQ_IRQ112MON_CANDINT             *((volatile  uint8_t *)(0x42627894UL))
#define bFM_INTREQ_IRQ112MON_I2S1DINT0            *((volatile  uint8_t *)(0x42627898UL))
#define bFM4_INTREQ_IRQ112MON_I2S1DINT0           *((volatile  uint8_t *)(0x42627898UL))
#define bFM_INTREQ_IRQ112MON_I2S1DINT1            *((volatile  uint8_t *)(0x4262789CUL))
#define bFM4_INTREQ_IRQ112MON_I2S1DINT1           *((volatile  uint8_t *)(0x4262789CUL))
#define bFM_INTREQ_IRQ112MON_GHSSPIDINT0          *((volatile  uint8_t *)(0x426278A0UL))
#define bFM4_INTREQ_IRQ112MON_GHSSPIDINT0         *((volatile  uint8_t *)(0x426278A0UL))
#define bFM_INTREQ_IRQ112MON_GHSSPIDINT1          *((volatile  uint8_t *)(0x426278A4UL))
#define bFM4_INTREQ_IRQ112MON_GHSSPIDINT1         *((volatile  uint8_t *)(0x426278A4UL))

#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT0         *((volatile  uint8_t *)(0x42627900UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT0        *((volatile  uint8_t *)(0x42627900UL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT1         *((volatile  uint8_t *)(0x42627904UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT1        *((volatile  uint8_t *)(0x42627904UL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT2         *((volatile  uint8_t *)(0x42627908UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT2        *((volatile  uint8_t *)(0x42627908UL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT3         *((volatile  uint8_t *)(0x4262790CUL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT3        *((volatile  uint8_t *)(0x4262790CUL))
#define bFM_INTREQ_IRQ113MON_USB_DRQ_INT4         *((volatile  uint8_t *)(0x42627910UL))
#define bFM4_INTREQ_IRQ113MON_USB_DRQ_INT4        *((volatile  uint8_t *)(0x42627910UL))
#define bFM_INTREQ_IRQ113MON_RCEC0INT             *((volatile  uint8_t *)(0x42627914UL))
#define bFM4_INTREQ_IRQ113MON_RCEC0INT            *((volatile  uint8_t *)(0x42627914UL))

